Repository: fekidam/smartpantri
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Language and Region
hu: Nyelv és Régió

source: Select Language
hu: Nyelv kiválasztása

source: Select Region
hu: Régió kiválasztása

source: English
hu: Angol

source: Hungarian
hu: Magyar

source: Hungary
hu: Magyarország

source: Recipe Suggestions
hu: Receptajánlatok

source: No recipes available
hu: Nincsenek elérhető receptek

source: View Details
hu: Részletek megtekintése

# failedToLoadImage
source: Failed to load recipe image. Please check your connection.
hu: Nem sikerült betölteni a recept képet. Kérlek, ellenőrizd a kapcsolatodat.

# failedToLoadGroup
source: Error loading group: {error}
hu: Hiba a csoport betöltésekor: {error}

source: Log In
hu: Bejelentkezés

source: Register
hu: Regisztráció

source: Continue with Google
hu: Folytatás Google-lal

source: Continue as Guest
hu: Folytatás vendégként

source: Continuing as Guest
hu: Folytatás vendégként

source: Google sign-in cancelled.
hu: Google bejelentkezés megszakítva.

# googleSignInError
source: Google sign-in error: {error}
hu: Google bejelentkezési hiba: {error}

source: Enter your email
hu: Add meg az email címed

source: Password
hu: Jelszó

source: Please fill in both fields!
hu: Kérlek, töltsd ki mindkét mezőt!

# pleaseVerifyYourEmail
source: Please verify your email to log in.
hu: Kérlek, erősítsd meg az email címedet a bejelentkezéshez.

source: User not found.
hu: Felhasználó nem található.

# wrongPassword
source: Invalid password.
hu: Érvénytelen jelszó.

# invalidEmail
source: Invalid email address.
hu: Érvénytelen email cím.

# loginError
source: Login error: {error}
hu: Bejelentkezési hiba: {error}

source: Don't have an account? Register
hu: Nincs fiókod? Regisztrálj

source: First Name
hu: Keresztnév

source: Last Name
hu: Vezetéknév

source: Confirm Password
hu: Jelszó megerősítése

source: Select Birth Date
hu: Születési dátum kiválasztása

# firstNameRequired
source: First name is required.
hu: A keresztnév kötelező.

# lastNameRequired
source: Last name is required.
hu: A vezetéknév kötelező.

# emailRequired
source: Email is required.
hu: Az email kötelező.

# invalidEmailFormat
source: Please enter a valid email address.
hu: Kérlek, adj meg egy érvényes email címet.

# passwordRequired
source: Password is required.
hu: A jelszó kötelező.

# passwordTooShort
source: Password must be at least 6 characters.
hu: A jelszónak legalább 6 karakterből kell állnia.

# confirmPasswordRequired
source: Please confirm your password.
hu: Kérlek, erősítsd meg a jelszavadat.

source: Passwords do not match.
hu: A jelszavak nem egyeznek.

# emailAlreadyInUse
source: This email is already in use.
hu: Ez az email cím már használatban van.

# weakPassword
source: Password is too weak.
hu: A jelszó túl gyenge.

# registrationFailed
source: Registration failed due to an unexpected error.
hu: A regisztráció váratlan hiba miatt sikertelen.

# registrationError
source: Error during registration.
hu: Hiba történt a regisztráció során.

# unknownError
source: An unknown error occurred.
hu: Ismeretlen hiba történt.

source: Verify Email
hu: Email megerősítése

# verificationEmailSent
source: A verification email has been sent to your email address.
hu: Egy megerősítő emailt küldtünk az email címedre.

source: I have verified my email
hu: Megerősítettem az email címemet

source: Please verify your email first.
hu: Kérlek, először erősítsd meg az email címedet.

source: No user found.
hu: Nincs ilyen felhasználó.

# errorSendingVerificationEmail
source: Error sending verification email: {error}
hu: Hiba a megerősítő email küldésekor: {error}

source: Your Groups
hu: Csoportjaid

source: Demo Group
hu: Demó Csoport

source: No groups found
hu: Nem találhatóak csoportok

source: Shared
hu: Megosztott

source: Edit Group
hu: Csoport szerkesztése

source: Group Name
hu: Csoport neve

source: Group Tag Color
hu: Csoport címke színe

source: Cancel
hu: Mégse

source: Save
hu: Mentés

source: Group updated successfully
hu: Csoport sikeresen frissítve

source: Group deleted
hu: Csoport törölve

# errorFetchingGroups
source: Error fetching groups: {error}
hu: Hiba a csoportok lekérésekor: {error}

# viewYourGroups
source: Consolidated List
hu: Összesített Lista

source: Home
hu: Főoldal

source: Recipes
hu: Receptek

source: Chat
hu: Csevegés

source: Notifications
hu: Értesítések

source: Profile
hu: Profil

# featureRequiresLogin
source: This feature requires login
hu: Ez a funkció bejelentkezést igényel

source: Create New Group
hu: Új csoport létrehozása

source: Select Color
hu: Szín kiválasztása

source: Add Group
hu: Csoport hozzáadása

# pleaseEnterGroupName
source: Please enter a group name.
hu: Kérlek, add meg a csoport nevét.

# userNotLoggedIn
source: User is not logged in
hu: A felhasználó nincs bejelentkezve

# failedToCreateGroup
source: Failed to create group. Please try again.
hu: Nem sikerült létrehozni a csoportot. Kérlek, próbáld újra.

# guestModeRestriction
source: Group creation is not available in guest mode. Please log in to use this feature.
hu: A csoportok létrehozása nem elérhető vendég módban. Kérlek, jelentkezz be a funkció használatához.

source: Share Group
hu: Csoport megosztása

source: Enter email to share with
hu: Add meg az email címet a megosztáshoz

# pleaseEnterEmailAddress
source: Please enter an email address.
hu: Kérlek, add meg az email címet.

# groupSharedSuccessfully
source: Group shared successfully! The user has been notified.
hu: Csoport sikeresen megosztva! A felhasználó értesítve lett.

# errorSharingGroup
source: Error sharing group: {error}
hu: Hiba a csoport megosztása során: {error}

source: Aggregated Shopping List
hu: Összevont bevásárlólista

source: No items in consolidated list.
hu: Nincsenek elemek az összevont listában.

# quantityLabel
source: Quantity
hu: Mennyiség

# priceLabel
source: Price
hu: Ár

# unitLabel
source: Unit
hu: Mértékegység

# unknownItem
source: Unknown
hu: Ismeretlen

# editItem
source: Edit: {itemName}
hu: Szerkesztés: {itemName}

# homeTitle
source: Home
hu: Főoldal

source: Expense Tracker
hu: Kiadáskövető

source: What's in the Fridge?
hu: Mi van a hűtőben?

source: Shopping List
hu: Bevásárlólista

source: Monthly Summary
hu: Havi összegzés

source: Total Expense
hu: Összes kiadás

source: By Users:
hu: Felhasználók szerint:

# noExpensesInGuestMode
source: Expenses are not available in guest mode.
hu: Vendég módban nem érhetők el kiadások.

source: No expenses found.
hu: Nem találhatóak kiadások.

source: Access denied
hu: Hozzáférés megtagadva

# noAccessToGroup
source: You do not have access to this group.
hu: Nincs hozzáférésed ehhez a csoporthoz.

# noItemsFoundInFridge
source: No items found in the fridge.
hu: Nem található elem a hűtőben.

source: Item expiring soon
hu: Termék hamarosan lejár

# itemExpiringMessage
source: {itemName} expires on: {expirationDate}!
hu: {itemName} lejár ekkor: {expirationDate}!

source: Expiration
hu: Lejárat

# setExpirationDateTime
source: Set Expiration Date and Time
hu: Lejárati dátum és idő beállítása

source: Error saving item
hu: Hiba az elem mentésekor

source: Expires
hu: Lejár

# noName
source: Unnamed
hu: Névtelen

# servingsLabel
source: Servings
hu: Adagok

# ingredientsLabel
source: Ingredients
hu: Hozzávalók

# instructionsLabel
source: Instructions
hu: Elkészítés

source: No instructions available
hu: Nincsenek elérhető utasítások

source: Failed to load recipe details
hu: Nem sikerült betölteni a recept részleteit

source: AI Chat
hu: AI Csevegés

source: Group Chat
hu: Csoportos Csevegés

source: Type a message...
hu: Írj egy üzenetet...

source: Enter message...
hu: Üzenet írása...

# errorSendingMessage
source: Error sending message: {error}
hu: Hiba az üzenet küldésekor: {error}

# needSharedGroupForFeature
source: A shared group is required for this feature.
hu: Ehhez a funkcióhoz megosztott csoport szükséges.

# featureOnlyInSharedGroups
source: This feature is only available in shared groups.
hu: Ez a funkció csak megosztott csoportokban érhető el.

source: Switch Chat
hu: Csevegés váltása

# notificationsNotAvailableInGuestMode
source: Notifications are not available in guest mode. Please log in to use this feature.
hu: Az értesítések nem érhetők el vendég módban. Kérlek, jelentkezz be a funkció használatához.

source: No notifications found.
hu: Nem találhatóak értesítések.

# errorLoadingNotifications
source: Error loading notifications: {error}
hu: Hiba az értesítések betöltésekor: {error}

source: Going Shopping
hu: Bevásárolni megyek

source: What's Missing?
hu: Mi hiányzik?

source: Who's Going Shopping?
hu: Ki megy bevásárolni?

source: I am going shopping today.
hu: Ma bevásárolni megyek.

# whatsMissingFromShoppingList
source: What's missing from the shopping list?
hu: Mi hiányzik a bevásárlólistáról?

source: Who's going shopping today?
hu: Ki megy ma bevásárolni?

# sender
source: {senderName}
hu: Feladó: {sender}

source: No message
hu: Nincs üzenet

source: No timestamp available
hu: Nincs elérhető időbélyeg

source: Settings
hu: Beállítások

source: Profile Settings
hu: Profilbeállítások

source: Privacy and Security
hu: Adatvédelem és Biztonság

source: Theme and Appearance
hu: Téma és Megjelenés

source: Return to Welcome Screen
hu: Vissza a Üdvözlőképernyőhöz

source: Log Out
hu: Kijelentkezés

# errorLoggingOut
source: Error logging out: {error}
hu: Hiba a kijelentkezés során: {error}

# guestModeSettingsNote
source: Note: Guest mode settings are saved locally on this device.
hu: Megjegyzés: A vendég mód beállításai helyben, ezen az eszközön kerülnek mentésre.

source: Dark Mode
hu: Sötét Mód

source: Pick a Color
hu: Szín kiválasztása

source: Current Color
hu: Jelenlegi szín

# errorSavingDarkMode
source: Error saving dark mode: {error}
hu: Hiba a sötét mód mentése során: {error}

# errorSavingColor
source: Error saving color: {error}
hu: Hiba a szín mentése során: {error}

source: Please log in to edit profile.
hu: Kérlek, jelentkezz be a profil szerkesztéséhez.

source: Crop Image
hu: Kép kivágása

# currentPasswordLabel
source: Current Password (required for password update)
hu: Jelenlegi Jelszó (jelszófrissítéshez szükséges)

# newPasswordLabel
source: New Password (optional)
hu: Új Jelszó (opcionális)

# passwordTooShortError
source: Password must be at least 6 characters.
hu: A jelszónak legalább 6 karakterből kell állnia.

# currentPasswordRequiredError
source: Please enter your current password to update your new password.
hu: Kérlek, add meg a jelenlegi jelszavadat az új jelszó frissítéséhez.

# profileUpdated
source: Your profile has been updated!
hu: A profilod frissítve!

# somethingWentWrong
source: Something went wrong: {error}
hu: Valami hiba történt: {error}

# imageTooLarge
source: Image too large. Maximum 2MB.
hu: A kép túl nagy. Maximum 2MB.

# profilePictureUpdated
source: Profile picture updated successfully!
hu: Profilkép sikeresen frissítve!

# errorUploadingImage
source: Error uploading image: {error}
hu: Hiba a kép feltöltése során: {error}

source: Managed by Google
hu: Google által kezelve

# twoFactorAuthentication
source: Two-Factor Authentication (2FA)
hu: Kétfaktoros Hitelesítés (2FA)

source: Logged In Devices
hu: Bejelentkezett Eszközök

source: Delete Account
hu: Fiók Törlése

# confirmDeleteAccount
source: Are you sure you want to delete your account? This action cannot be undone.
hu: Biztosan törölni szeretnéd a fiókodat? Ez a művelet nem vonható vissza.

source: Please log in to use 2FA
hu: Kérlek, jelentkezz be a 2FA használatához

# errorSavingDeviceInfo
source: Error saving device info: {error}
hu: Hiba az eszközinformációk mentése során: {error}

# userEmailMissing
source: User email is missing.
hu: A felhasználói email hiányzik.

# wait60SecondsForNewCode
source: Please wait 60 seconds before requesting a new code.
hu: Kérlek, várj 60 másodpercet, mielőtt új kódot kérsz.

source: Disable 2FA
hu: 2FA Kikapcsolása

# confirmDisable2FA
source: Are you sure you want to disable Two-Factor Authentication?
hu: Biztosan ki szeretnéd kapcsolni a Kétfaktoros Hitelesítést?

source: Disable
hu: Kikapcsolás

# twoFAEnabled
source: 2FA enabled via email.
hu: 2FA engedélyezve emailen keresztül.

source: Invalid verification code.
hu: Érvénytelen ellenőrző kód.

# twoFADisabled
source: 2FA disabled.
hu: 2FA kikapcsolva.

# errorDuring2FASetup
source: Error during 2FA setup: {error}
hu: Hiba a 2FA beállítása során: {error}

source: Enter Email Verification Code
hu: Add meg az Email Ellenőrző Kódot

# codeExpirationNote
source: You have 10 minutes to enter the code before it expires.
hu: 10 perced van a kód megadására, mielőtt lejár.

# sixDigitCodeLabel
source: 6-digit code
hu: 6 jegyű kód

source: Resend Code
hu: Kód Újraküldése

source: Verify
hu: Ellenőrzés

# pleaseEnterCode
source: Please enter the code.
hu: Kérlek, add meg a kódot.

# invalidCodeError
source: Please enter a valid 6-digit code.
hu: Kérlek, adj meg egy érvényes 6 jegyű kódot.

source: Code resent successfully.
hu: Kód sikeresen újraküldve.

# failedToResendEmail
source: Failed to resend email. Please try again later.
hu: Nem sikerült újraküldeni az emailt. Kérlek, próbáld újra később.

# errorResendingCode
source: Error resending code: {error}
hu: Hiba a kód újraküldése során: {error}

# unexpectedErrorResendingCode
source: Unexpected error resending code: {error}
hu: Váratlan hiba a kód újraküldése során: {error}

# noUserLoggedIn
source: No user is currently logged in.
hu: Jelenleg nincs bejelentkezett felhasználó.

# emailOrPasswordEmpty
source: Email or password cannot be empty.
hu: Az email vagy jelszó nem lehet üres.

# enterPasswordToConfirm
source: Enter your password to confirm
hu: Add meg a jelszavadat a megerősítéshez

# pleaseEnterPassword
source: Please enter your password.
hu: Kérlek, add meg a jelszavadat.

# accountDeleted
source: Account deleted successfully.
hu: Fiók sikeresen törölve.

# errorDeletingAccount
source: Error deleting account: {error}
hu: Hiba a fiók törlése során: {error}

# userNotLoggedInError
source: User is not logged in.
hu: A felhasználó nincs bejelentkezve.

source: No logged in devices found.
hu: Nem találhatóak bejelentkezett eszközök.

# errorLoadingDevices
source: Error loading devices: {error}
hu: Hiba az eszközök betöltése során: {error}

# lastLoginLabel
source: Last Login: {lastLogin}
hu: Utolsó Bejelentkezés: {lastLogin}

source: Sign Out
hu: Kijelentkezés

# deviceSignedOut
source: {deviceName} signed out.
hu: {deviceName} kijelentkezett.

# errorSigningOut
source: Error signing out: {error}
hu: Hiba a kijelentkezés során: {error}

source: Enable Notifications
hu: Értesítések Engedélyezése

source: Message Notifications
hu: Üzenet Értesítések

source: Update Notifications
hu: Frissítési Értesítések

source: Select Allergies
hu: Allergiák Kiválasztása

source: Select All
hu: Összes Kiválasztása

source: Deselect All
hu: Összes Kiválasztás Törlése

# allergyDairy
source: Dairy
hu: Tejtermék

# allergyEgg
source: Egg
hu: Tojás

# allergyGluten
source: Gluten
hu: Glutén

# allergyPeanut
source: Peanut
hu: Földimogyoró

# allergySeafood
source: Seafood
hu: Tengeri ételek

# allergySesame
source: Sesame
hu: Szezám

# allergyShellfish
source: Shellfish
hu: Kagylók

# allergySoy
source: Soy
hu: Szója

# allergySulfite
source: Sulfite
hu: Szulfit

# allergyTreeNut
source: Tree Nut
hu: Diófélék

# allergyWheat
source: Wheat
hu: Búza

# guestCartLimitMessage
source: Guest users can add up to {limit} items. Please log in to add more.
hu: A vendég felhasználók legfeljebb {limit} terméket adhatnak hozzá. Kérlek, jelentkezz be, hogy többet adhass hozzá.

# itemAlreadySelectedBy
source: This item is already selected by {selectedBy}.
hu: Ezt a terméket már {selectedBy} kiválasztotta.

# onlyDeleteOwnItems
source: You can only delete items you added.
hu: Csak azokat a termékeket törölheted, amelyeket te adtál hozzá.

# onlyEditOwnItems
source: You can only edit items you added.
hu: Csak azokat a termékeket szerkesztheted, amelyeket te adtál hozzá.

source: Search for Products
hu: Termékek keresése

source: Shopping Cart
hu: Bevásárlókosár

# itemRemoved
source: {itemName} removed
hu: {itemName} eltávolítva

# selectedBy
source: Selected by: {selectedBy}
hu: Kiválasztotta: {selectedBy}

# unitKg
source: kilogram
hu: kilogramm

# unitG
source: gram
hu: gramm

# unitPcs
source: piece
hu: darab

source: Add New Product
hu: Új termék hozzáadása

# nameLabelEn
source: Name (English, optional)
hu: Név (angol, opcionális)

# nameLabelHu
source: Name (Hungarian)
hu: Név (magyar)

# categoryLabelEn
source: Category (English, optional)
hu: Kategória (angol, opcionális)

# categoryLabelHu
source: Category (Hungarian)
hu: Kategória (magyar)

# fillAllFields
source: Please fill in all required fields!
hu: Kérlek, töltsd ki az összes kötelező mezőt!

# productAdded
source: Product added successfully!
hu: Termék sikeresen hozzáadva!

# optionalFieldsNote
source: English fields are optional when using Hungarian settings.
hu: Az angol mezők kitöltése nem kötelező magyar nyelvi beállítás esetén.

# fillAtLeastOneName
source: Please fill in at least one name (Hungarian or English)!
hu: Kérlek töltsd ki legalább az egyik nevet (magyar vagy angol)!

# fillAtLeastOneCategory
source: Please fill in at least one category (Hungarian or English)!
hu: Kérlek töltsd ki legalább az egyik kategóriát (magyar vagy angol)!

# fillHungarianName
source: Please fill in the Hungarian name!
hu: Kérlek töltsd ki a magyar nevet!

# fillHungarianCategory
source: Please fill in the Hungarian category!
hu: Kérlek töltsd ki a magyar kategóriát!

# fillEnglishName
source: Please fill in the English name!
hu: Kérlek töltsd ki az angol nevet!

# fillEnglishCategory
source: Please fill in the English category!
hu: Kérlek töltsd ki az angol kategóriát!

# translationApiKeyMissing
source: Google Translate API key is missing.
hu: Hiányzik a Google Translate API kulcs.

# failedToTranslateText
source: Failed to translate text: {statusCode} - {body}
hu: Nem sikerült a szöveg fordítása: {statusCode} - {body}

# translationError
source: Translation error: {error}
hu: Fordítási hiba: {error}

# errorCheckingVerification
source: Error checking verification: {error}
hu: Hiba az email ellenőrzése során: {error}

# addToCart
source: Add to Cart: {itemName}
hu: Hozzáadás a kosárhoz: {itemName}

# itemEdited
source: Item edited: {itemName}
hu: Tétel szerkesztve: {itemName}

source: Guest
hu: Vendég

source: Fair Share
hu: Tisztességes rész

source: per user
hu: felhasználónként

# totalLabel
source: Total
hu: Összesen

source: Unknown
hu: Ismeretlen

# errorCheckingGroupMembership
source: Error checking group membership: {error}
hu: Hiba a csoporttagság ellenőrzése során: {error}

# apiKeyMissing
source: OpenAI API key is missing.
hu: Hiányzik az OpenAI API kulcs.

# aiResponseError
source: Error fetching AI response: Status {statusCode}, {body}
hu: Hiba az AI válasz lekérése során: Állapot {statusCode}, {body}

# failedToReceiveAIResponse
source: Failed to receive a response from the AI.
hu: Nem sikerült választ kapni az AI-tól.

source: No group ID found.
hu: Nem található csoport azonosító.

source: Group not found.
hu: A csoport nem található.

# errorNavigatingToGroupChat
source: Error navigating to group chat: {error}
hu: Hiba a csoportos csevegésre navigálás során: {error}

source: No messages yet.
hu: Még nincsenek üzenetek.

source: Welcome to Your Groups!
hu: Üdvözöljük a Csoportjaidnál!

# yourGroupsInfo
source: This screen helps you manage all your groups. If you shop from multiple groups, their items will be consolidated here, so you don’t need to check each group’s shopping list individually. You just have to push the Consolidated list button!
hu: Ez a képernyő segít a csoportjaid kezelésében. Ha több csoportból szeretnél termékeket megvásárolni, azok itt összevonásra kerülnek, így nem kell mindig egyenként megnézned a csoportok bevásárlólistáit. Csak kattints az Összesített Lista gombra!

source: Got It
hu: Megértettem

# youLeftTheGroup
source: You have left the group.
hu: Elhagytad a csoportot.

source: Welcome to SmartPantri!
hu: Üdvözöljük a SmartPantri-ban!

# welcomeDialogMessage
source: This app helps you manage your shopping lists across multiple groups. Add items, track expenses, and see what's in your fridge—all in one place.
hu: Ez az alkalmazás segít a bevásárlólisták kezelésére több csoportban. Adjon hozzá termékeket, kövesse nyomon a kiadásokat, és nézze meg, mi van a hűtőjében – mindezt egy helyen.

# yourGroupsInfoTitle
source: Your Groups Information
hu: Információ a Csoportjaidról

# aggregatedListInfoTitle
source: About the Aggregated Shopping List
hu: Az Összevont Bevásárlólistáról

# aggregatedListInfoMessage
source: In this list, you can mark items as purchased by ticking the checkbox. If you delete an item with the checkbox ticked, it will be added to your Expense Tracker and What's in the Fridge sections. If unticked, the item will simply be removed.
hu: Ebben a listában a jelölőnégyzettel megjelölheti a megvásárolt termékeket. Ha egy terméket a jelölőnégyzet bepipálásával töröl, az hozzáadódik a Kiadáskövetőhöz és a 'Mi van a hűtőben?' szekcióhoz. Ha nincs bepipálva, a termék egyszerűen törlődik.

# alreadyHaveAccountLogin
source: Already have an account? Log in
hu: Már van fiókod? Jelentkezz be

# registrationErrorUnexpected
source: Unexpected registration error.
hu: Váratlan regisztrációs hiba.

source: Too Many Requests.
hu: Túl sok kérés.

# outOfScopeResponse
source: I cannot answer this question. I can only assist with application usage and recipes.
hu: Sajnos erre a kérdésre nem tudok válaszolni, csak az alkalmazás használatával és receptekkel kapcsolatban tudok segíteni.

source: Gradient opacity
hu: Gradiens átlátszóság

source: Icon style
hu: Ikonstílus

source: Font size
hu: Betűméret

source: Use global theme
hu: Globális téma használata

source: Delete
hu: Törlés

source: Continue to App
hu: Folytatás az alkalmazásban

source: Email verified successfully!
hu: Email sikeresen megerősítve!

# offlineModeMessage
source: You are in offline mode. Some features may be unavailable.
hu: Offline módban vagy. Előfordulhat, hogy néhány funkció nem megfelelő.
